import Layout from '../../layout';
import styles from '../../styles/Policy.module.css';

export default function Contact() {

    return (
        <Layout>
            <div className={styles.policy}> 
                <p>我们尊重并保护您的隐私。因此，我们制定了一项隐私政策，涵盖了我们如何收集、使用、披露、转移和存储您的信息。请花点时间熟悉我们的隐私惯例，以明确我们如何处理您的个人信息、我们收集和不收集的内容以及原因。</p>

                <p className={styles.hint}>1. 个人信息的收集和使用目的</p>
                <p>我们的主要任务是安全地处理用户的个人信息。此类信息仅可在用户同意的目的和范围内或相关法律法规另有规定的情况下用于提供无缝服务。在注册过程中，您可能会被要求提供您的个人信息，以及我们的必要服务。我们仅将必要的数据用于（1）提供准确的皮肤/头发分析结果和产品推荐服务，（2）统计目的和（3）提高服务质量的可用性（提供应用程序使用指南、通知和促销活动和时事通讯）以及（3）改进算法和训练人工智能模型，这些模型将应用于分析服务以提高准确性。 .当用户注册服务或用户使用服务时，通过主页、个别应用程序和程序等收集以下最低限度的个人信息。</p>

                <p className={styles.hint}>2. 我们收集哪些个人信息</p>
                <p>A. 所需信息：提供相关服务基本特征所需的信息 出生年份、性别、种族、照片*、诊断结果和服务记录。 * 敏感信息：此应用程序可能会收集用户的面部和皮肤/头发/头皮的照片，这些照片是应用程序进行适当咨询过程所需的，这是应用程序的主要目的。特别是面部照片用于应用程序的完整面部查看服务，用户可以在执行详细的基于参数的过程之前轻松了解一般皮肤状况和问题。这些数据不会被其他用户看到，也不会在未经您同意的情况下分享给任何第三方。此外，这些数据可以根据用户的要求立即全部删除。</p>
                <p>B. 可选信息：为提供更专业的服务而需要收集的附加信息姓名、电子邮件地址、电话号码。地址</p>
                <p>C. 自动收集的数据当您使用我们的应用程序时，我们还会收集识别您的移动设备和您对平台使用情况的数据。我们存储的信息包括通知访问、设备特定设置和特征、系统活动、位置详细信息、IP 地址、语言设置、应用程序崩溃和其他设备事件信息、访问数据和您使用应用程序的时间。</p>
                <p>D. 儿童的个人资料 我们的服务只能在您年满十八 (18) 岁或以上时使用。当我们识别个人信息时，十八（18）岁以下的儿童，我们将根据我们的法律义务删除数据。</p>

                <p className={styles.hint}>3. 我们如何使用您的个人信息</p>
                <p>A. 我们使用我们收集的个人信息来提供可持续的客户管理并确定适当的服务，例如产品推荐。</p>
                <p>B. 需要用户同意的用户的个人信息是在用户使用特定服务之前获得用户同意后收集的，该同意是通过选中单独的在线复选框或通过离线文档来表示的。如果用户在离线文档的同意字段中勾选在线复选框或标记，则视为用户同意收集和处理相关个人信息。</p>

                <p className={styles.hint}>4. 向第三方提供个人信息</p>
                <p>A. 本公司仅在收集和使用个人信息的目的范围内使用每个用户的个人信息，未经用户事先同意，不得使用个人信息。超出该目的的信息或向公司外部提供个人信息，但以下情况除外： (1) 用户明确同意 (2) 适用法律法规要求 (3) 统计、学术、市场或行业需要以无法识别的格式进行研究。</p>
                <p>B. 在适用的情况下，用户可以拒绝同意向第三方提供个人信息，但在这种情况下，用户可能会被限制使用第三方提供的服务。</p>
                <p>C. 将用户的个人信息提供给国外的第三方时，本公司应告知用户，并在必要时另行征得同意。</p>

                <p className={styles.hint}>5. 个人信息处理委托及个人信息向海外转移</p>
                <p>本公司可能会将个人信息处理工作委托给第三方，以履行提供服务的合同并提高用户的便利性。本公司向第三方提供用户的个人信息时，必要时应告知用户并征得用户同意。截至今天，部分个人信息被转移到海外以执行以下事务： - 转移公司：Amazon Web Services, Inc - 地址：1 Rue Rateau, 93120 La Courneuve, France - 转移国家：法国 - 转移数据：收集的所有数据在本隐私政策中指定的应用程序上 - 传输目的：云数据分析和保存在亚马逊网络服务中 - 被转让公司的保留期限：只要是实现本隐私中规定的相关目的合理必要的时间通知和在法律要求或允许的期限内。</p>

                <p className={styles.hint}>6. 用户个人资料的保留</p>
                <p>作为一般规则，公司将出于本隐私政策第 1 条规定的收集目的处理和保留用户的个人数据最多一 (1) 年，之后公司将删除用户的个人数据。信息。用户拍摄的照片（面部）将被存储最多五（5）年，仅用于研发目的，以便在用户同意的情况下提高分析的准确性，之后公司将删除相关数据。此外，当用户撤回其注册或同意时，公司将及时采取必要措施删除或删除用户数据。</p>

                <p className={styles.hint}>7. 删除个人信息的程序和方法</p>
                <p>当个人信息变得不必要时，包括在适用于个人信息的保留/使用期限届满时以及在达到处理个人信息的目的时，公司会立即删除个人信息。删除个人信息的程序和方法如下：</p>
                <p>A. 删除程序：公司选择发生需要销毁事件的个人信息，并在获得公司个人信息保护官的批准后删除个人信息。</p>
                <p>B. 销毁方法：对于记录或存储在电子文件中的个人信息，本公司通过确保个人信息不可恢复或不可复制的技术或物理方法删除个人信息，对于记录的个人信息或存储在纸质文件中，公司使用粉碎机粉碎个人信息或焚烧个人信息。</p>
                <p>C. 对于任何非因本公司的过错造成的损失或损害，包括因用户的疏忽或在非本公司管理的区域内发生的任何事故（例如，收集的用户个人信息），本公司概不负责。在本公司已履行个人信息处理者义务的范围内，由化妆品店、皮肤诊所或护肤品店等购买或出借本公司预制品使用）；在本公司采取第6条规定的个人信息安全措施的前提下，因本公司内部管理人员的疏忽或技术管理事故导致用户的个人信息丢失、泄露、篡改或损坏时，公司应将此事实告知用户并寻求适当的行动和补救措施</p>

                <p className={styles.hint}>8. 用户访问、更正和撤回其同意的权利对于本公司收集的任何个人信息，用户可以随时要求访问（检查）、更正（修改）、撤回任何给定的同意（退出会员资格或终止合同）、删除或暂停处理。 此外，本公司将采取一切必要措施，确保与收集个人信息的方式相比，撤回对收集个人信息的同意（退出会员）更容易。</p>

                <p className={styles.hint}>9. 个人信息保护官</p>
                <p>A. 公司指定并运营以下个人信息保护官和个人信息保护部门，负责个人信息一般事务，以处理和补救数据主体的投诉，并开展与个人信息处理相关的其他客户服务</p>
                <p>B. 个人信息保护官 - 姓名：Ryan Won Suk Choi - 职务/职位：C.E.O. - 联系方式：地址：A-1301-2, 184, Jungbu-daero, Giheung-gu, Yonginsi, Gyeonggi-do, South Korea 17950. 电子邮件：privacy@chowis.com</p>
                <p>C. 用户可以通过邮件或电子邮件向个人信息保护官查询上述事项。该请求将得到适当和及时的处理。当用户要求更正个人信息时，在更正完成之前不会显示相关信息。</p>

                <p className={styles.hint}>10. 隐私政策的变更</p>
                <p>如有必要，本隐私政策可能会根据法律、政府政策或公司内部政策进行更改或修订，如有任何增加、删除或更改，将提前通过公司网站上的“通知”通知在此类添加、删除或更改的生效日期之前，用户权利的任何重大更改。</p>
                <p style={{marginTop: '2rem'}}>公司：Chowis Co.,Ltd.  以及吉林省昭盈偲国际贸易有限公司</p>
                <p>隐私政策版本信息：v.6</p>
                <p>隐私政策执行日期：2023.1.18</p>

            </div>
        </Layout>
    );
}
